# Data Cleaning
- change data type
- fill nan value
- drop duplicates

In [ ]:
import pandas as pd

df=pd.read_csv('/Users/abby/Python_data_project/2_Advanced/data_jobs.csv')

df['job_posted_date'].dtype #.dtype is a property, not a method, no need () to call

dtype('O')

- dtype('O') means the data type is object
- 'O' is short for object dtype, which is a generic way to store any Python object

üîπ What does object dtype usually mean in pandas?
- Strings (most common)
- Mixed data types
- Python objects (e.g. lists, dictionaries, etc.)

In [1]:
import pandas as pd

df=pd.read_csv('/Users/abby/Python_data_project/2_Advanced/data_jobs.csv')

df['job_posted_date']=pd.to_datetime(df['job_posted_date'])

#### dt.to_period
-  df['year_month'] = df['date_column'].dt.to_period('M')
- This will give you a Period object like 2025-06.

In [3]:
df.loc[:10,'salary_year_avg':'salary_hour_avg']

    salary_year_avg  salary_hour_avg
0               NaN              NaN
1               NaN              NaN
2               NaN              NaN
3               NaN              NaN
4               NaN              NaN
5               NaN              NaN
6               NaN              NaN
7               NaN              NaN
8               NaN              NaN
9               NaN              NaN
10              NaN              NaN

In [5]:
median_salary_year=df['salary_year_avg'].median()
median_salary_year

115000.0

In [6]:
median_salary_hour=df['salary_hour_avg'].median()
median_salary_hour

45.97999954223633

## Fill NaN values with median number

In [ ]:
df_filled=df
df_filled['salary_year_avg']=df_filled['salary_year_avg'].fillna(median_salary_year) 
#fill and then assign back to the original variable
df_filled['salary_hour_avg']=df_filled['salary_hour_avg'].fillna(median_salary_hour)
df_filled.loc[:10,'salary_year_avg':'salary_hour_avg']

    salary_year_avg  salary_hour_avg
0          115000.0            45.98
1          115000.0            45.98
2          115000.0            45.98
3          115000.0            45.98
4          115000.0            45.98
5          115000.0            45.98
6          115000.0            45.98
7          115000.0            45.98
8          115000.0            45.98
9          115000.0            45.98
10         115000.0            45.98

## Drop duplicate values in the dataframe

In [14]:
df_unique=df_filled
df_unique = df_unique.drop_duplicates()

print(f'The length of original dataframe: {len(df)}')
print(f'The length of filled dataframe: {len(df_filled)}')
print(f'The length of dropped duplicates dataframe: {len(df_unique)}')
print(f'Rows are dropped: {len(df_filled)-len(df_unique)}')

The length of original dataframe: 785741
The length of filled dataframe: 785741
The length of dropped duplicates dataframe: 785640
Rows are dropped: 101

| Method              | In-place by Default? | Supports `inplace=True`? | Returns New Object? |
| ------------------- | -------------------- | ------------------------ | ------------------- |
| `fillna()`          | ‚ùå No                 | ‚úÖ Yes                    | ‚úÖ Yes               |
| `dropna()`          | ‚ùå No                 | ‚úÖ Yes                    | ‚úÖ Yes               |
| `drop_duplicates()` | ‚ùå No                 | ‚úÖ Yes                    | ‚úÖ Yes               |

## drop_duplicates() on specific columns by using the subset parameter.

Syntax:  
'df.drop_duplicates(subset=['column1', 'column2'], keep='first', inplace=False)'

- keep='first': keeps the first occurrence (default)
- keep='last': keeps the last occurrence
- keep=False: drops all duplicates  
**keep='first' is the default for drop_duplicates()**

In [28]:
df_unique_job_title=df_filled
df_unique_job_title=df_unique_job_title.drop_duplicates(subset=['job_title_short','company_name'])
df_unique_job_title[['job_title_short','company_name']].sort_values(by='job_title_short')

          job_title_short                                       company_name
135554   Business Analyst                                    ALTER SOLUTIONS
111096   Business Analyst                             Stanley Black & Decker
111099   Business Analyst                                            Colgate
111116   Business Analyst  ENTERPRISE ADVANCED SYSTEM INTELLIGENCE PTE. LTD.
111118   Business Analyst                             Propertyguru Pte. Ltd.
...                   ...                                                ...
686721  Software Engineer                                             Sybrin
178536  Software Engineer                                  BELCOTECH TUNISIE
178579  Software Engineer                                   Ali Babu Sdn Bhd
178613  Software Engineer             Elegant Enterprise- Wide Solutions Inc
785740  Software Engineer                                             Trigyn

[241850 rows x 2 columns]

In [29]:
print(f'The length of original dataframe: {len(df)}')
print(f'The length of filled dataframe: {len(df_filled)}')
print(f'The length of dropped duplicates dataframe: {len(df_unique_job_title)}')
print(f'Rows are dropped: {len(df_filled)-len(df_unique_job_title)}')

The length of original dataframe: 785741
The length of filled dataframe: 785741
The length of dropped duplicates dataframe: 241850
Rows are dropped: 543891

In [25]:
df['job_title_short'].unique()

array(['Senior Data Engineer', 'Data Analyst', 'Data Engineer',
       'Business Analyst', 'Data Scientist', 'Machine Learning Engineer',
       'Senior Data Analyst', 'Cloud Engineer', 'Senior Data Scientist',
       'Software Engineer'], dtype=object)

| Method              | Replaces original? (in-place) | Default `inplace` | Returns new object? | Example Syntax                       |
| ------------------- | ----------------------------- | ----------------- | ------------------- | ------------------------------------ |
| `drop()`            | No                            | ‚ùå `inplace=False` | ‚úÖ Yes               | `df.drop(['col1'], axis=1)`          |
| `drop_duplicates()` | No                            | ‚ùå `inplace=False` | ‚úÖ Yes               | `df.drop_duplicates(subset=['col'])` |
| `dropna()`          | No                            | ‚ùå `inplace=False` | ‚úÖ Yes               | `df.dropna(subset=['col'])`          |
| `fillna()`          | No                            | ‚ùå `inplace=False` | ‚úÖ Yes               | `df.fillna(0)`                       |
| `sort_values()`     | No                            | ‚ùå `inplace=False` | ‚úÖ Yes               | `df.sort_values(by='col')`           |
| `replace()`         | No                            | ‚ùå `inplace=False` | ‚úÖ Yes               | `df.replace({'old': 'new'})`         |
| `rename()`          | No                            | ‚ùå `inplace=False` | ‚úÖ Yes               | `df.rename(columns={'old': 'new'})`  |

‚úÖ Fill NaNs in a specific column

1. df_filled= df.fillna({'column_name': value})
2. df['column_name'] = df['column_name'].fillna(value)

In [ ]:
# Drop rows with index 3 and 4
df.drop([3, 4], axis=0)

# Drop columns named 'col1' and 'col2'
df.drop(['col1', 'col2'], axis=1)

Summary:
- If you want to drop rows, either omit axis or set axis=0  
- If you want to drop columns, you must specify axis=1


## Dropping a single cell 
- setting it to NaN or some placeholder  
import numpy as np
<df.loc[row_index, 'column_name'] = np.nan>

- To remove data entirely, drop the row or column containing it

| Feature        | `df.count()`                 | `df['col'].value_counts()`   |
| -------------- | ---------------------------- | ---------------------------- |
| Works on       | Whole DataFrame              | Single column (Series) only  |
| Returns        | Count of non-null values     | Frequency of unique values   |
| Includes NaNs? | ‚ùå No (ignores NaNs)          | ‚ùå No (skips NaNs by default) |
| Axis support   | ‚úÖ Yes (`axis=0` or `axis=1`) | ‚ùå No axis support            |
| Output         | Series (column-wise count)   | Series (value: count)        |

## Practice

Remove rows where the salary_year_avg column has missing values. Display the number of rows before and after removing.

In [32]:
import pandas as pd
df=pd.read_csv('/Users/abby/Python_data_project/2_Advanced/data_jobs.csv')
df['job_posted_date']=pd.to_datetime(df['job_posted_date'])

df_removed=df.dropna(subset='salary_year_avg')
print(f'Rows before removing missing values: {len(df)}')
print(f'Rows after removing missing values: {len(df_removed)}')

Rows before removing missing values: 785741
Rows after removing missing values: 22003

Remove duplicate rows from the DataFrame based on the job_location column. Display the number of rows before and after removing duplicates.

In [33]:
import pandas as pd
df=pd.read_csv('/Users/abby/Python_data_project/2_Advanced/data_jobs.csv')
df['job_posted_date']=pd.to_datetime(df['job_posted_date'])

df_unique_job_locations=df.drop_duplicates(subset='job_location')
print(f'Rows before removing duplicate job locations: {len(df)}')
print(f'Rows after removing duplicate job locations: {len(df_unique_job_locations)}')

Rows before removing duplicate job locations: 785741
Rows after removing duplicate job locations: 17218

Fill missing values in the salary_rate column with the string 'Unknown'. Display the first 10 rows of the salary_rate column before and after filling.

In [ ]:
import pandas as pd
df=pd.read_csv('/Users/abby/Python_data_project/2_Advanced/data_jobs.csv')
df['job_posted_date']=pd.to_datetime(df['job_posted_date'])

df_filledrate=df
df_filledrate['salary_rate'] = df_filledrate['salary_rate'].fillna('Unknow')
print(df['salary_rate'].head(10))
print(df_filledrate['salary_rate'].head(10))

0    Unknow
1    Unknow
2    Unknow
3    Unknow
4    Unknow
5    Unknow
6    Unknow
7    Unknow
8    Unknow
9    Unknow
Name: salary_rate, dtype: object
0    Unknow
1    Unknow
2    Unknow
3    Unknow
4    Unknow
5    Unknow
6    Unknow
7    Unknow
8    Unknow
9    Unknow
Name: salary_rate, dtype: object

In [ ]:
import pandas as pd
df=pd.read_csv('/Users/abby/Python_data_project/2_Advanced/data_jobs.csv')
df['job_posted_date']=pd.to_datetime(df['job_posted_date'])

df_filledrate=df.copy()
df_filledrate['salary_rate'] = df_filledrate['salary_rate'].fillna('Unknow')
print(df['salary_rate'].head(10))
print(df_filledrate['salary_rate'].head(10))

"""
salary_rate_before = df['salary_rate'].head(10)
df_filled = df.fillna({'salary_rate': 'Unknown'})
salary_rate_after = df_filled['salary_rate'].head(10)
salary_rate_before, salary_rate_after
"""

0    NaN
1    NaN
2    NaN
3    NaN
4    NaN
5    NaN
6    NaN
7    NaN
8    NaN
9    NaN
Name: salary_rate, dtype: object
0    Unknow
1    Unknow
2    Unknow
3    Unknow
4    Unknow
5    Unknow
6    Unknow
7    Unknow
8    Unknow
9    Unknow
Name: salary_rate, dtype: object

In [ ]:
df_filledrate=df

# This line does not create a new copy of the DataFrame ‚Äî 
# it simply creates a second reference (alias) to the same object in memory.

| Code              | Behavior                             |
| ----------------- | ------------------------------------ |
| `df2 = df`        | üîó Both refer to the **same** object |
| `df2 = df.copy()` | üÜï Creates a **separate** copy       |

In [5]:
import pandas as pd
df=pd.read_csv('/Users/abby/Python_data_project/2_Advanced/data_jobs.csv')
df['job_posted_date']=pd.to_datetime(df['job_posted_date'])

df_new=df
df_cp=df.copy()
df_new['salary_rate']=df_new['salary_rate'].fillna('Not Available')
print(df['salary_rate'].head(3))
print(df_new['salary_rate'].head(3))
print(df_cp['salary_rate'].head(3))

0    Not Available
1    Not Available
2    Not Available
Name: salary_rate, dtype: object
0    Not Available
1    Not Available
2    Not Available
Name: salary_rate, dtype: object
0    NaN
1    NaN
2    NaN
Name: salary_rate, dtype: object

In [6]:
df_new is df

True

In [ ]:
df_cp is df # only copy() can create a new independent dataframe

False